Определите схему куба, по которой у вас будут собираться данные.
Для этого
1) определите какие таблицы у вас будет Dim_
2) а какая Fact_
3) определите связи по ключам между Dim_ и Fact_
4) нарисуйте схему данных (можно сделать скриншот из DataSourceView проекта VS)
5) укажите по каким срезам (slice) вы планируете стоить ответы своего проекта


1)

DIM_City
DIM_Region
DIM_Country
DIM_Brand
DIM_Category
DIM_Product
DIM_Time

2)

FACT_ProductSales

3) 4) ссылки в чате

5) Например сумма продаж или число проданных товаров выбранного бренда в выбранном месяце, или
продажи товаров в зависимости от города и месяца продаж



